* Template
|----------------------------+-------+--------+-------+-----------|
| Configuration              | First | Second | Third | Average   |
|----------------------------+-------+--------+-------+-----------|
| Example with one train     |       |        |       | vmean([]) |
| Example with two trains    |       |        |       | vmean([]) |
| Shared Segment             |       |        |       | vmean([]) |
| Large Network              |       |        |       | vmean([]) |
| Station One                |       |        |       | vmean([]) |
| Station Two                |       |        |       | vmean([]) |
| Station Four               |       |        |       | vmean([]) |
| Station Six                |       |        |       | vmean([]) |
| Station Eight              |       |        |       | vmean([]) |
| Station Ten                |       |        |       | vmean([]) |
| Station Twelfth            |       |        |       | vmean([]) |
| Two trains same direction  |       |        |       | vmean([]) |
| Four trains same direction |       |        |       | vmean([]) |
| Nærumbanen (2T)            |       |        |       | vmean([]) |
|----------------------------+-------+--------+-------+-----------|
#+TBLFM: $5=vmean($2..$4)

* No derailment (Move between connected segments)
** Elapsed time
#+PLOT: title:"Elapsed time (No derailment: Move between connected segments)" deps:(5) set:"xrange[0:]"
|----------------------------+----------+----------+----------+-------------|
| Configuration              |    First |   Second |    Third |     Average |
|----------------------------+----------+----------+----------+-------------|
| Example with one train     |    0.004 |    0.004 |    0.004 |        4e-3 |
| Example with two trains    |    0.025 |    0.027 |    0.028 | 0.026666667 |
| Shared Segment             |    0.018 |     0.02 |    0.015 | 0.017666667 |
| Large Network              |    0.017 |    0.028 |    0.023 | 0.022666667 |
| Station One                |    0.017 |    0.016 |    0.015 |       0.016 |
| Station Two                |     0.18 |    0.187 |     0.19 |  0.18566667 |
| Station Four               |    8.239 |    8.075 |    8.076 |        8.13 |
| Station Six                |  176.213 |  175.867 |  176.697 |     176.259 |
| Station Eight              | 1127.661 | 1124.994 | 1128.751 |   1127.1353 |
| Station Ten                | 4311.035 | 4309.434 | 4313.687 |   4311.3853 |
| Station Twelfth            |      DNA |      DNA |      DNA |         DNA |
| Two trains same direction  |    0.028 |    0.034 |    0.023 | 0.028333333 |
| Four trains same direction |      DNF |      DNF |      DNF |         DNF |
| Nærumbanen (2T)            |  114.581 |  114.372 |  114.491 |   114.48133 |
| Nærumbanen (3T)            | 4375.625 | 4437.235 | 4543.133 |   4451.9977 |
|----------------------------+----------+----------+----------+-------------|
#+TBLFM: $5=vmean($2..$4)

** Memory Usage Peak
#+PLOT: title:"Memory Usage Peak (No derailment: Move between connected segments)" deps:(5) set:"xrange[0:]"
|----------------------------+----------+----------+----------+-----------|
| Configuration              |    First |   Second |    Third |   Average |
|----------------------------+----------+----------+----------+-----------|
| Example with one train     |    5.992 |    5.996 |    5.996 | 5.9946667 |
| Example with two trains    |    6.536 |    6.536 |    6.536 |     6.536 |
| Shared Segment             |    7.484 |    7.488 |    7.536 | 7.5026667 |
| Large Network              |    8.948 |    8.980 |    8.984 | 8.9706667 |
| Station One                |    6.480 |    6.500 |    6.508 |     6.496 |
| Station Two                |    9.908 |    9.940 |    9.944 | 9.9306667 |
| Station Four               |   41.412 |   41.540 |   41.556 | 41.502667 |
| Station Six                |  152.812 |  152.908 |  152.908 |   152.876 |
| Station Eight              |  422.192 |  422.384 |  422.392 | 422.32267 |
| Station Ten                |  954.604 |  954.948 |  954.960 | 954.83733 |
| Station Twelfth            |      DNA |      DNA |      DNA |       DNA |
| Two trains same direction  |    7.540 |    7.544 |    7.592 | 7.5586667 |
| Four trains same direction |      DNF |      DNF |      DNF |       DNF |
| Nærumbanen (2T)            |  122.060 |  122.396 |  122.420 |   122.292 |
| Nærumbanen (3T)            | 1834.760 | 1834.804 | 1834.812 |  1834.792 |
|----------------------------+----------+----------+----------+-----------|
#+TBLFM: $5=vmean($2..$4)

* No derailment (Critical section)
** Elapsed time
#+PLOT: title:"Elapsed time (No derailment: No trains in the critical section)" deps:(5) set:"xrange[0:]"
|----------------------------+----------+----------+----------+-------------|
| Configuration              |    First |   Second |    Third |     Average |
|----------------------------+----------+----------+----------+-------------|
| Example with one train     |    0.004 |    0.004 |    0.004 |        4e-3 |
| Example with two trains    |    0.015 |    0.025 |    0.018 | 0.019333333 |
| Shared Segment             |    0.023 |    0.021 |    0.019 |       0.021 |
| Large Network              |    0.026 |    0.023 |    0.023 |       0.024 |
| Station One                |     0.01 |    0.012 |    0.017 |       0.013 |
| Station Two                |     0.18 |    0.203 |    0.211 |       0.198 |
| Station Four               |    8.055 |    8.083 |    8.074 |   8.0706667 |
| Station Six                |  172.488 |  172.487 |  173.026 |     172.667 |
| Station Eight              | 1138.254 | 1136.482 | 1139.334 |   1138.0233 |
| Station Ten                | 4346.405 |  4327.87 | 4331.854 |   4335.3763 |
| Station Twelfth            |      DNA |      DNA |      DNA |         DNA |
| Two trains same direction  |     0.02 |    0.028 |    0.028 | 0.025333333 |
| Four trains same direction |      DNF |      DNF |      DNF |         DNF |
| Nærumbanen (2T)            |  113.146 |  112.966 |  112.577 |   112.89633 |
| Nærumbanen (3T)            | 4616.238 | 4564.949 | 4581.939 |   4587.7087 |
|----------------------------+----------+----------+----------+-------------|
#+TBLFM: $5=vmean($2..$4)

** Memory Usage Peak
#+PLOT: title:"Memory Usage Peak (No derailment: No trains in the critical section)" deps:(5) set:"xrange[0:]"
|----------------------------+----------+----------+----------+-----------|
| Configuration              |    First |   Second |    Third |   Average |
|----------------------------+----------+----------+----------+-----------|
| Example with one train     |    5.988 |    5.988 |    5.988 |     5.988 |
| Example with two trains    |    6.528 |    6.528 |    6.532 | 6.5293333 |
| Shared Segment             |    7.476 |    7.480 |    7.484 |      7.48 |
| Large Network              |    8.952 |    8.984 |    8.996 | 8.9773333 |
| Station One                |    6.468 |    6.484 |    6.484 | 6.4786667 |
| Station Two                |    9.892 |    9.916 |    9.920 | 9.9093333 |
| Station Four               |   41.404 |   41.520 |   41.528 |    41.484 |
| Station Six                |  152.800 |  152.876 |  152.876 | 152.85067 |
| Station Eight              |  422.180 |  422.364 |  422.364 | 422.30267 |
| Station Ten                | 1050.988 | 1243.744 | 1244.084 | 1179.6053 |
| Station Twelfth            |      DNA |      DNA |      DNA |       DNA |
| Two trains same direction  |    7.524 |    7.528 |    7.532 |     7.528 |
| Four trains same direction |      DNF |      DNF |      DNF |       DNF |
| Nærumbanen (2T)            |  122.032 |  122.124 |  122.368 | 122.17467 |
| Nærumbanen (3T)            | 1833.100 | 1833.140 | 1833.140 | 1833.1267 |
|----------------------------+----------+----------+----------+-----------|
#+TBLFM: $5=vmean($2..$4)

* No collision
** Elapsed time
#+PLOT: title:"Elapsed time (No collision)" deps:(5) set:"xrange[0:]"
|----------------------------+----------+----------+----------+-------------|
| Configuration              |    First |   Second |    Third |     Average |
|----------------------------+----------+----------+----------+-------------|
| Example with one train     |    0.004 |    0.004 |    0.004 |        4e-3 |
| Example with two trains    |    0.018 |    0.018 |    0.024 |        0.02 |
| Shared Segment             |    0.015 |     0.02 |    0.023 | 0.019333333 |
| Large Network              |    0.023 |    0.032 |    0.027 | 0.027333333 |
| Station One                |    0.011 |    0.017 |    0.012 | 0.013333333 |
| Station Two                |    0.183 |    0.215 |    0.187 |       0.195 |
| Station Four               |     8.09 |    8.115 |    8.241 |   8.1486667 |
| Station Six                |  176.156 |  175.635 |  175.459 |      175.75 |
| Station Eight              | 1144.312 | 1146.043 | 1144.102 |    1144.819 |
| Station Ten                | 4327.887 | 4350.655 | 4352.747 |    4343.763 |
| Station Twelfth            |      DNA |      DNA |      DNA |         DNA |
| Two trains same direction  |    0.024 |    0.029 |    0.022 |       0.025 |
| Four trains same direction |      DNF |      DNF |      DNF |         DNF |
| Nærumbanen (2T)            |  111.647 |  111.867 |  111.601 |     111.705 |
| Nærumbanen (3T)            | 4707.002 | 4711.929 | 4683.026 |   4700.6523 |
|----------------------------+----------+----------+----------+-------------|
#+TBLFM: $5=vmean($2..$4)

** Memory Usage Peak
#+PLOT: title:"Memory Usage Peak (No collision)" deps:(5) set:"xrange[0:]"
|----------------------------+----------+----------+----------+-----------|
| Configuration              |    First |   Second |    Third |   Average |
|----------------------------+----------+----------+----------+-----------|
| Example with one train     |    5.996 |    5.992 |    5.996 | 5.9946667 |
| Example with two trains    |    6.548 |    6.552 |    6.576 | 6.5586667 |
| Shared Segment             |    7.480 |    7.532 |    7.554 |     7.522 |
| Large Network              |    8.960 |    9.000 |    9.016 |     8.992 |
| Station One                |    6.492 |    6.520 |    6.532 | 6.5146667 |
| Station Two                |    9.912 |    9.952 |    9.968 |     9.944 |
| Station Four               |   41.416 |   41.548 |   41.560 |    41.508 |
| Station Six                |  152.804 |  152.904 |  152.916 | 152.87467 |
| Station Eight              |  422.196 |  422.388 |  422.396 | 422.32667 |
| Station Ten                |  955.772 |  954.604 |  954.952 | 955.10933 |
| Station Twelfth            |      DNA |      DNA |      DNA |       DNA |
| Two trains same direction  |    7.536 |    7.588 |    7.600 | 7.5746667 |
| Four trains same direction |      DNF |      DNF |      DNF |       DNF |
| Nærumbanen (2T)            |  122.040 |  122.144 |  122.404 |   122.196 |
| Nærumbanen (3T)            | 1833.096 | 1833.144 | 1833.148 | 1833.1293 |
|----------------------------+----------+----------+----------+-----------|
#+TBLFM: $5=vmean($2..$4)

* Will arrive
** Elapsed time
#+PLOT: title:"Elapsed time (Will arrive)" deps:(5) set:"xrange[0:]"
|----------------------------+----------+----------+----------+--------------|
| Configuration              |    First |   Second |    Third |      Average |
|----------------------------+----------+----------+----------+--------------|
| Example with one train     |    0.003 |    0.004 |    0.003 | 3.3333333e-3 |
| Example with two trains    |    0.026 |    0.025 |    0.026 |  0.025666667 |
| Shared Segment             |    0.021 |    0.022 |    0.017 |         0.02 |
| Large Network              |     0.02 |    0.027 |    0.021 |  0.022666667 |
| Station One                |    0.017 |    0.012 |    0.016 |        0.015 |
| Station Two                |    0.191 |    0.196 |    0.203 |   0.19666667 |
| Station Four               |    8.081 |    8.118 |    8.129 |    8.1093333 |
| Station Six                |  178.496 |  176.697 |  177.664 |      177.619 |
| Station Eight              | 1134.646 | 1132.922 | 1133.608 |    1133.7253 |
| Station Ten                | 4318.385 | 4306.554 | 4316.069 |    4313.6693 |
| Station Twelfth            |      DNA |      DNA |      DNA |          DNA |
| Two trains same direction  |    0.021 |    0.025 |    0.031 |  0.025666667 |
| Four trains same direction |      DNF |      DNF |      DNF |          DNF |
| Nærumbanen (2T)            |  113.356 |  113.335 |  113.301 |    113.33067 |
| Nærumbanen (3T)            | 4768.012 | 4734.325 | 4725.702 |    4742.6797 |
|----------------------------+----------+----------+----------+--------------|
#+TBLFM: $5=vmean($2..$4)

** Memory Usage Peak
#+PLOT: title:"Memory Usage Peak (Will arrive)" deps:(5) set:"xrange[0:]"
|----------------------------+----------+----------+----------+-----------|
| Configuration              |    First |   Second |    Third |   Average |
|----------------------------+----------+----------+----------+-----------|
| Example with one train     |    5.960 |    5.960 |    5.956 | 5.9586667 |
| Example with two trains    |    6.500 |    6.504 |    6.504 | 6.5026667 |
| Shared Segment             |    7.452 |    7.452 |    7.452 |     7.452 |
| Large Network              |    8.912 |    8.928 |    8.932 |     8.924 |
| Station One                |    6.436 |    6.440 |    6.440 | 6.4386667 |
| Station Two                |    9.860 |    9.880 |    9.880 | 9.8733333 |
| Station Four               |   41.372 |   41.456 |   41.460 | 41.429333 |
| Station Six                |  152.688 |  152.764 |  152.764 | 152.73867 |
| Station Eight              |  421.808 |  421.980 |  421.980 | 421.92267 |
| Station Ten                |  953.328 |  953.672 |  953.672 | 953.55733 |
| Station Twelfth            |      DNA |      DNA |      DNA |       DNA |
| Two trains same direction  |    7.504 |    7.504 |    7.504 |     7.504 |
| Four trains same direction |      DNF |      DNF |      DNF |       DNF |
| Nærumbanen (2T)            |  122.016 |  122.104 |  122.116 | 122.07867 |
| Nærumbanen (3T)            | 1833.016 | 1833.052 | 1833.052 |   1833.04 |
|----------------------------+----------+----------+----------+-----------|
#+TBLFM: $5=vmean($2..$4)
